//	‰Û‘è
#include <stdio.h>

int main(void)
{
	// ‹L“ü—á
	//printf("‰‰ŽZ“à—e:%s ‰‰ŽZŒ‹‰Ê:%d\n", " 5 + 8", 5 + 8);

	printf("‰‰ŽZ“à—e:%s ‰‰ŽZŒ‹‰Ê%d\n", "10 + 18",10 + 18);
	printf("‰‰ŽZ“à—e:%s ‰‰ŽZŒ‹‰Ê%d\n", "20 - 8",20 - 8);
	printf("‰‰ŽZ“à—e:%s ‰‰ŽZŒ‹‰Ê%d\n", "3 - 9",3 - 9);
	printf("‰‰ŽZ“à—e:%s ‰‰ŽZŒ‹‰Ê%d\n", "5 * 8",5 * 8);
	printf("‰‰ŽZ“à—e:%s ‰‰ŽZŒ‹‰Ê%d\n", "- 3 * 9", - 3 * 9);
	printf("‰‰ŽZ“à—e:%s ‰‰ŽZŒ‹‰Ê%d\n", "10 / 2",10 / 2);
	printf("‰‰ŽZ“à—e:%s ‰‰ŽZŒ‹‰Ê%d\n", "10 / 3",10 / 3);
	printf("‰‰ŽZ“à—e:%s ‰‰ŽZŒ‹‰Ê%d\n", "11 % 3",11 % 3);
	printf("‰‰ŽZ“à—e:%s ‰‰ŽZŒ‹‰Ê%d\n", "3+2* 6",3+2* 6);
	printf("‰‰ŽZ“à—e:%s ‰‰ŽZŒ‹‰Ê%d\n", "(3 + 2) * 6",(3 + 2) * 6);
	return 0;
}