//	課題
//---------------------------------------------------------------
//	フルーツ関連の情報と処理を定義する
//---------------------------------------------------------------
#include <stdio.h>
#include "fruit.h"

//---------------------------------------------------------------
//	部品4
//---------------------------------------------------------------
#define	D_FRUIT_NAMESIZE	(32)

//---------------------------------------------------------------
//	部品2
//---------------------------------------------------------------
typedef struct
{
	char		name[D_FRUIT_NAMESIZE];
	long		price;
} S_FRUIT_INFO;


//---------------------------------------------------------------
//	部品5　外部変数(ローカル変数)
//---------------------------------------------------------------
const static S_FRUIT_INFO fruitTable[E_FRUIT_ID_NUM] =
{
	//name   //price
	{ "リンゴ",	200},
	{ "みかん",	100},
	{ "バナナ",	80},
	{ "桃",		400},
};


//---------------------------------------------------------------
//	部品8
//---------------------------------------------------------------
static int printFruit(E_FRUIT_ID id);


void printFruitAll(void)
{
	int i;

	//	全フルーツ情報の表示
	for (i=0 ; i < E_FRUIT_ID_NUM ; i++)
	{
		printFruit(i);
	}

	return;
}

long getFruitPrice(E_FRUIT_ID id)
{
	//	IDの有効範囲チェック
	if (id < E_FRUIT_ID_APPLE || E_FRUIT_ID_NUM <= id)
	{
		return -1;
	}

	return fruitTable[id].price;
}

//---------------------------------------------------------------
//	部品12
//---------------------------------------------------------------
static int printFruit(E_FRUIT_ID id)
{
	//	IDの有効範囲チェック
	if (id < E_FRUIT_ID_APPLE || E_FRUIT_ID_NUM <= id)
	{
		return -1;
	}

	printf("ID：%d 種類：%s 価格：%d\n", id, fruitTable[id].name, fruitTable[id].price);

	return 0;
}

//---------------------------------------------------------------