//	課題
//---------------------------------------------------------------
//	システム全体を管理する
//---------------------------------------------------------------
#include <stdio.h>

//---------------------------------------------------------------
//	部品10
//---------------------------------------------------------------
#include "fruit.h"


//---------------------------------------------------------------
//	部品9
//---------------------------------------------------------------
static long main_calcFruit(void);

int main(void)
{
	long priceAll = 0;

	//	フルーツ情報の表示
	printFruitAll();

	//	フルーツの購入価格計算
	priceAll = main_calcFruit();

	//	総額表示
	printf("フルーツ総額：%d\n", priceAll);

	return 0;
}

//---------------------------------------------------------------
//	部品11
//---------------------------------------------------------------
static long main_calcFruit(void)
{
	long price = 0;

	//	みかん2個
	price += getFruitPrice(E_FRUIT_ID_ORANGE) * 2;//200

	//	桃3個
	price += getFruitPrice(E_FRUIT_ID_PEACH) * 3;//1200

	//	リンゴ1個
	price += getFruitPrice(E_FRUIT_ID_APPLE) * 1;//200   合計は1600

	return price;
}
